In [9]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [4]:
X = np.array ([[1,2],
              [2,4],
              [5,6]])
y = np.array([0,1,0])

In [92]:
data = pd.read_csv(r"C:\Tomato\titanic_set\titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [139]:
data.shape

(891, 12)

In [160]:

data1 = data.drop(['PassengerId','Name', 
                   'SibSp', 'Parch','Ticket',
                   'Cabin','Embarked'], axis = 1)

data1.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [161]:
data1 = data1.replace('male',0)
data1 = data1.replace('female',1)
data1.head()

   Survived  Pclass  Sex   Age     Fare
0         0       3    0  22.0   7.2500
1         1       1    1  38.0  71.2833
2         1       3    1  26.0   7.9250
3         1       1    1  35.0  53.1000
4         0       3    0  35.0   8.0500

In [167]:
y = data1['Survived']
y.shape
data1= data1.drop(['Survived'], axis = 1)

In [168]:
data1 = data1.dropna()
data1 = data1.reset_index(drop = True)
data1.shape

(714, 4)

In [169]:
clf = DecisionTreeClassifier(random_state = 241)
clf.fit(data1, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=241,
            splitter='best')

In [171]:
importances = clf.feature_importances_
print(importances)

[0.14751816 0.30051221 0.25124241 0.30072722]